app/controllers/shouts_controller.rb

  def index
    @shouts = Shout.all
---
SELECT "shouts".* FROM "shouts"

  def create
    @shout = Shout.new(shout_params)
    if @shout.save
---
INSERT INTO "shouts" ("message", "lat", "lng", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "adsfasfd"], ["lat", 37.784633], ["lng", 122.397414], ["created_at", "2015-04-01 04:15:33.328302"], ["updated_at", "2015-04-01 04:15:33.328302"]]